README.org
* Персональное рабочее окружение  ☮ λ ☯

** Прочный фундамент

- В основе - интерпретатор, вокруг которого построены средства разработки, редактор и всё прочее окружение пользователя;
- Это /литературная программа/, которую легко понять, даже если вы не знакомы с другими языками программирования;
- Это концентрированный опыт нескольких поколений хакеров, четыре десятка лет совместного труда  людей со всего мира;

** Интегрированная среда

- /LISP/ является интерфейсом для внешних программ и OS, вся мощность /UNIX/ доступна посредством высокоуровневого языка, но не заменяется им;
- Моды (режимы) добавляют функциональность, расширяя возможности среды, н не заменяют её. В разных модах сохраняются привычные сочетания, знакомое, предсказуемое поведение системы;
- Моды образуют симбиозы: например, режим управления проектами интегрирован с режимом для работы с репозитариями GIT, а режим поддержки конкретного языка программирования использует общие для всех языков инструменты для анализа кода, в телеграм можно переводить выделенный текст (`<C-c v>`) итд;
- Моды создают контекст твоего рабочего процесса: например, режим Управления Проектами определяет контекст для автоматического открытия терминала (`s-‘`) в корневой директории текущего проекта;
- Во внешних приложениях также поддерживаются основные клавиши для навигации курсора, вставки из стека, переключения языка итп;

** Универсальное управление окнами, вкладками и рабочими столами

- Один из /фреймов/ всегда на экране;
- На /фрейме/ одна или более /вкладок/;
- Содержимое /вкладки/ может быть поделено на несколько /окон/;
- В каждом /окне/ отображается какой-либо один /буфер/ - файл или приложение;
- Один /буфер/ может отображаться в нескольких /окнах/;
- Конфигурацию фрейма, вкладок и окон можно «сохранить» ;
- Действия с /окнами/ и /буферами/ можно легко «откатить» к предыдущмм состояниям (`<s-u>/<s-U>`);

** Программирование на всех языках

- Если язык программирования существует, то про это есть мод на /LISP/;
- Современный Протокол Языкового Сервера (LSP) поддерживает десятки языков;
- подсказки по коду;
- навигация по проектам;
- семантический анализатор;

** Организация дел

- Система управления задачами;
- Личная Wiki ;
- Фиксация времени;
- Интегрированный инструмент для организации работы и управления знаниями;

** Интернет и коммуникация

- Встроеный текстовый браузер для безопасного просмотра нормальных HTML страниц;
- Встроеный удобный и многофункциональный почтовый клиент, для получения почты используются внешние утилиты;
- Встроеный удобный клиент новостных лент RSS, источники добавляются в простой org-файл
- Встроеный клиент IRC;
- Удобный Telegram с масштабированием текста;
- Возможность видеть на экране сразу несколько чатов;

** Простота и минимализм

- Никаих лишних элементов  
- Цветовая тема в градациях серого, интенсивное использование типографики, рациональное использование цветов;
- Вместо строки статуса у каждого окна, /статус/ /буфера/, часы и трей с иконками - всё это находится в /минибуфере/, пока тот неактивен;

** Искусственный Интеллект

** Проекты, репозитории

** Контейнеры и кластеры
  
** Настройка для себя

- Модульная организация нонфигурации, в первую очередь литературная программа;
- Быстрые сочетания можно задать в простой текстовой таблице ([[./сочетания-клавиш.org]]);
- Любой сценарий использования системы расширяется благодаря /режимам/, /обработчикам/ и /перехватчикам/;
- На *LISP* можно описывать уникальные конфигурации рабочих окружений, окон и вкладок, чтобы затем мгновенно воспроизводить когда они потребуются;

** Хороший встроеный редактор

Классический стиль комбинированных сочетаний с модальностью (Режим Бога);


