README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-26 Пт 12:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="az" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4df96c2">1. Персональное рабочее окружение  ☮ λ ☯</a>
<ul>
<li><a href="#org81f725b">1.1. Прочный фундамент</a></li>
<li><a href="#orge40f2d3">1.2. Интегрированная среда</a></li>
<li><a href="#org24ba391">1.3. Универсальное управление окнами, вкладками и рабочими столами</a></li>
<li><a href="#orge975cfa">1.4. Программирование на всех языках</a></li>
<li><a href="#orgd423b82">1.5. Организация дел</a></li>
<li><a href="#org79f3b8a">1.6. Интернет и коммуникация</a></li>
<li><a href="#orgf6d2072">1.7. Простота и минимализм</a></li>
<li><a href="#org0783d4c">1.8. Искусственный Интеллект</a></li>
<li><a href="#org180cb75">1.9. Проекты, репозитории</a></li>
<li><a href="#orga5dee4a">1.10. Контейнеры и кластеры</a></li>
<li><a href="#orga414b69">1.11. Настройка для себя</a></li>
<li><a href="#org3e74e1f">1.12. Хороший встроеный редактор</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4df96c2" class="outline-2">
<h2 id="org4df96c2"><span class="section-number-2">1.</span> Персональное рабочее окружение  ☮ λ ☯</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org81f725b" class="outline-3">
<h3 id="org81f725b"><span class="section-number-3">1.1.</span> Прочный фундамент</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>В основе - интерпретатор, вокруг которого построены средства разработки, редактор и всё прочее окружение пользователя;</li>
<li>Это <i>литературная программа</i>, которую легко понять, даже если вы не знакомы с другими языками программирования;</li>
<li>Это концентрированный опыт нескольких поколений хакеров, четыре десятка лет совместного труда  людей со всего мира;</li>
</ul>
</div>
</div>

<div id="outline-container-orge40f2d3" class="outline-3">
<h3 id="orge40f2d3"><span class="section-number-3">1.2.</span> Интегрированная среда</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><i>LISP</i> является интерфейсом для внешних программ и OS, вся мощность <i>UNIX</i> доступна посредством высокоуровневого языка, но не заменяется им;</li>
<li>Моды (режимы) добавляют функциональность, расширяя возможности среды, н не заменяют её. В разных модах сохраняются привычные сочетания, знакомое, предсказуемое поведение системы;</li>
<li>Моды образуют симбиозы: например, режим управления проектами интегрирован с режимом для работы с репозитариями GIT, а режим поддержки конкретного языка программирования использует общие для всех языков инструменты для анализа кода, в телеграм можно переводить выделенный текст (`&lt;C-c v&gt;`) итд;</li>
<li>Моды создают контекст твоего рабочего процесса: например, режим Управления Проектами определяет контекст для автоматического открытия терминала (`s-‘`) в корневой директории текущего проекта;</li>
<li>Во внешних приложениях также поддерживаются основные клавиши для навигации курсора, вставки из стека, переключения языка итп;</li>
</ul>
</div>
</div>

<div id="outline-container-org24ba391" class="outline-3">
<h3 id="org24ba391"><span class="section-number-3">1.3.</span> Универсальное управление окнами, вкладками и рабочими столами</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Один из <i>фреймов</i> всегда на экране;</li>
<li>На <i>фрейме</i> одна или более <i>вкладок</i>;</li>
<li>Содержимое <i>вкладки</i> может быть поделено на несколько <i>окон</i>;</li>
<li>В каждом <i>окне</i> отображается какой-либо один <i>буфер</i> - файл или приложение;</li>
<li>Один <i>буфер</i> может отображаться в нескольких <i>окнах</i>;</li>
<li>Конфигурацию фрейма, вкладок и окон можно «сохранить» ;</li>
<li>Действия с <i>окнами</i> и <i>буферами</i> можно легко «откатить» к предыдущмм состояниям (`&lt;s-u&gt;/&lt;s-U&gt;`);</li>
</ul>
</div>
</div>

<div id="outline-container-orge975cfa" class="outline-3">
<h3 id="orge975cfa"><span class="section-number-3">1.4.</span> Программирование на всех языках</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Если язык программирования существует, то про это есть мод на <i>LISP</i>;</li>
<li>Современный Протокол Языкового Сервера (LSP) поддерживает десятки языков;</li>
<li>подсказки по коду;</li>
<li>навигация по проектам;</li>
<li>семантический анализатор;</li>
</ul>
</div>
</div>

<div id="outline-container-orgd423b82" class="outline-3">
<h3 id="orgd423b82"><span class="section-number-3">1.5.</span> Организация дел</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Система управления задачами;</li>
<li>Личная Wiki ;</li>
<li>Фиксация времени;</li>
<li>Интегрированный инструмент для организации работы и управления знаниями;</li>
</ul>
</div>
</div>

<div id="outline-container-org79f3b8a" class="outline-3">
<h3 id="org79f3b8a"><span class="section-number-3">1.6.</span> Интернет и коммуникация</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Встроеный текстовый браузер для безопасного просмотра нормальных HTML страниц;</li>
<li>Встроеный удобный и многофункциональный почтовый клиент, для получения почты используются внешние утилиты;</li>
<li>Встроеный удобный клиент новостных лент RSS, источники добавляются в простой org-файл</li>
<li>Встроеный клиент IRC;</li>
<li>Удобный Telegram с масштабированием текста;</li>
<li>Возможность видеть на экране сразу несколько чатов;</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6d2072" class="outline-3">
<h3 id="orgf6d2072"><span class="section-number-3">1.7.</span> Простота и минимализм</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>Никаих лишних элементов</li>
<li>Цветовая тема в градациях серого, интенсивное использование типографики, рациональное использование цветов;</li>
<li>Вместо строки статуса у каждого окна, <i>статус</i> <i>буфера</i>, часы и трей с иконками - всё это находится в <i>минибуфере</i>, пока тот неактивен;</li>
</ul>
</div>
</div>

<div id="outline-container-org0783d4c" class="outline-3">
<h3 id="org0783d4c"><span class="section-number-3">1.8.</span> Искусственный Интеллект</h3>
</div>

<div id="outline-container-org180cb75" class="outline-3">
<h3 id="org180cb75"><span class="section-number-3">1.9.</span> Проекты, репозитории</h3>
</div>

<div id="outline-container-orga5dee4a" class="outline-3">
<h3 id="orga5dee4a"><span class="section-number-3">1.10.</span> Контейнеры и кластеры</h3>
</div>

<div id="outline-container-orga414b69" class="outline-3">
<h3 id="orga414b69"><span class="section-number-3">1.11.</span> Настройка для себя</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Модульная организация нонфигурации, в первую очередь литературная программа;</li>
<li>Быстрые сочетания можно задать в простой текстовой таблице (<a href="./сочетания-клавиш.html">./сочетания-клавиш.html</a>);</li>
<li>Любой сценарий использования системы расширяется благодаря <i>режимам</i>, <i>обработчикам</i> и <i>перехватчикам</i>;</li>
<li>На <b>LISP</b> можно описывать уникальные конфигурации рабочих окружений, окон и вкладок, чтобы затем мгновенно воспроизводить когда они потребуются;</li>
</ul>
</div>
</div>

<div id="outline-container-org3e74e1f" class="outline-3">
<h3 id="org3e74e1f"><span class="section-number-3">1.12.</span> Хороший встроеный редактор</h3>
<div class="outline-text-3" id="text-1-12">
<p>
Классический стиль комбинированных сочетаний с модальностью (Режим Бога);
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: az</p>
<p class="date">Created: 2023-05-26 Пт 12:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>